---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.SketchFailures.TrussSegmentedReference
source: html/16402fd9-2132-ba6b-6a96-c8ec2ad518d8.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SketchFailures.TrussSegmentedReference Property

Truss reference must form a continuous chain of one or more sketch lines.

## Syntax (C#)
```csharp
public static FailureDefinitionId TrussSegmentedReference { get; }
```